app/controllers/api/boards_controller.rb

  def index
    @boards = Board.all
---
SELECT "boards".* FROM "boards"

  def create
    @board = Board.new(board_params)
    @board.user_id = session_user.id
    if @board.save
---
INSERT INTO "boards" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First "], ["created_at", "2020-04-06 15:40:09.352884"], ["updated_at", "2020-04-06 15:40:09.352884"], ["user_id", 1]]

  def show
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]