app/controllers/api/cards_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cards" ("title", "list_id", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First"], ["list_id", 3], ["position", 32767.5], ["created_at", "2020-04-06 20:51:21.647705"], ["updated_at", "2020-04-06 20:51:21.647705"]]
---
  def create
    list = List.find(params[:list_id])
    copy_from = params[:card][:copy_from]
    copy_from_card = Card.find(copy_from) if copy_from

    if copy_from
      @card = copy_from_card.dup
      @card.assign_attributes(card_params)
      @card.list = List.find(params[:list_id])
    else
      @card = list.cards.new(card_params)
    end

    ActiveRecord::Base.transaction do
      if @card.save

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @card = Card.find(params[:id])

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cards" SET "list_id" = $1, "position" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["list_id", 3], ["position", 32767.5], ["updated_at", "2020-04-06 20:50:45.006019"], ["id", 1]]
---
  def update
    @card = Card.find(params[:id])
    @card.assign_attributes(card_params)

    ActiveRecord::Base.transaction do
      create_actions(@card) if @card.valid?

      if @card.save

INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", " added this card to First List"], ["actionable_type", "Card"], ["actionable_id", 1], ["created_at", "2020-04-05 20:19:24.815749"], ["updated_at", "2020-04-05 20:19:24.815749"]]
INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", " added this card to First"], ["actionable_type", "Card"], ["actionable_id", 1], ["created_at", "2020-04-06 18:42:54.369973"], ["updated_at", "2020-04-06 18:42:54.369973"]]
INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create_actions(card, options = {})
    if options[:new]
      if card_id = params[:card][:copy_from]
        original_card = Card.find(card_id)
        card.actions.create!(description: " copied this card from #{original_card.title} in list #{original_card.list.title}")
      else
        card.actions.create!(description: " added this card to #{card.list.title}")
      end

      return
    end

    if card.due_date_changed?
      if card.due_date
        if card.due_date.year == Date.today.year
          due_date = card.due_date.strftime("%b %e at %l:%M %p")
        else
          due_date = card.due_date.strftime("%b %e, %Y at %l:%M %p")
        end

        if card.due_date_was
          card.actions.create!(description: " changed the due date of this card to #{due_date}")
        else
          card.actions.create!(description: " set the due date of this card to #{due_date}")

INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", " marked the due date complete"], ["actionable_type", "Card"], ["actionable_id", 5], ["created_at", "2020-04-06 20:58:42.000118"], ["updated_at", "2020-04-06 20:58:42.000118"]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "transferred this card from First "], ["actionable_type", "Card"], ["actionable_id", 1], ["created_at", "2020-04-06 20:50:45.004038"], ["updated_at", "2020-04-06 20:50:45.004038"]]
---

    if card.completed_changed?
      completion = card.completed ? "complete" : "incomplete"
      card.actions.create!(description: " marked the due date #{completion}")
    end

    if card.list_id_changed?
      old_list = List.find(card.list_id_was)

      if old_list.board == card.list.board
        card.actions.create!(
          description: "moved this card from #{old_list.title} to #{card.list.title}"
        )
      else
        card.actions.create!(
          description: "transferred this card from #{old_list.board.title}"
        )

INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", " archived this card"], ["actionable_type", "Card"], ["actionable_id", 5], ["created_at", "2020-04-06 20:58:30.848936"], ["updated_at", "2020-04-06 20:58:30.848936"]]
INSERT INTO "actions" ("description", "actionable_type", "actionable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", " sent this card to the board"], ["actionable_type", "Card"], ["actionable_id", 5], ["created_at", "2020-04-06 20:58:33.418068"], ["updated_at", "2020-04-06 20:58:33.418068"]]
---

    if card.archived_changed?
      if card.archived?
        card.actions.create!(description: " archived this card")
      else
        card.actions.create!(description: " sent this card to the board")