app/controllers/api/comments_controller.rb

  def create
    card = Card.find(params[:card_id])
    @comment = card.comments.new(comment_params)

    if @comment.save
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "New comment"], ["card_id", 5], ["created_at", "2020-04-06 20:51:36.302398"], ["updated_at", "2020-04-06 20:51:36.302398"]]