app/controllers/api/lists_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lists" ("title", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First"], ["board_id", 1], ["created_at", "2020-04-06 18:42:50.733376"], ["updated_at", "2020-04-06 18:42:50.733376"]]
---
  def create
    board = Board.find(params[:board_id])
    @list = List.new(list_params.merge(board: board))

    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    @list = List.find(params[:id])